'''
Розробити програму-довідник, яка за введеним значенням радіуса r пропонуватиме користувачу допомогу в обчисленні n (номер
послуги): 1 - довжини кола, 2 - площі круга, 3 - об’єму кулі, 4 - площіповерхні кулі. Дані вводять в такому порядку: r, n.

Іван Токар
'''

r= float(input("Введіть  занчення радіуса R: "))
n= int(input("Оберіть формулу n:"))

if n==1:
    L=2*3.14*r
    print("R=",r, L )
elif n==2:
    A=3.14*r^2
    print("R=",r, A )
elif n==3:
    V=(4/3)*3.14*r^2
    print("R=",r, V )
elif n==4:
    S=4*3.14*r^2
    print("R=",r, S )